Tekla Open API Reference for Tekla Structures 2025
ContainerElement Class
 The ContainerElement class defines container elements. A container element is a mark element that has a frame and contains other mark elements. A container element may also contain container elements to achieve nested frames.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.ContainerElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ContainerElement : ElementBase,
	ICollection, IEnumerable
<SerializableAttribute>
Public NotInheritable Class ContainerElement
	Inherits ElementBase
	Implements ICollection, IEnumerable
The ContainerElement type exposes the following members.
Constructors
Name | Description
ContainerElement
Initializes a new instance of the ContainerElement class
Top
Properties
Name | Description
Count
 Gets the number of elements contained in the ICollection.
Frame
 The frame of the container element.
IsSynchronized
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
SyncRoot
 Gets an object that can be used to synchronize access to the ICollection.
Top
Methods
Name | Description
Add
 Adds a new element base to the end of the list.
Clear
 Removes all elements from the container instance.
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
CopyTo
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
GetEnumerator
 Returns an enumerator that iterates through a collection.
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace